{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c17693a8-99ee-4090-81ae-d74991a12519",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "from neo4j import GraphDatabase\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "from pprint import pprint\n",
    "import time\n",
    "from tqdm import tqdm\n",
    "\n",
    "pd.set_option('display.max_columns', None)\n",
    "pd.set_option('display.max_rows', 1000)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "378ea4b4-5bc3-4de7-b1ff-c5c1b8210025",
   "metadata": {},
   "source": [
    "## Senzing resolved data\n",
    "\n",
    "Prior to running this notebook, you need to have run the entity resolution within the Senzing Docker container.  Here I have export the results of that run to the file `entities.json`.  You can see below what that file looks like.  We will use this then to create relationships between resolved and related entities."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ad18c06d-c447-4fe0-bccc-7f02b1d0a3f8",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = []\n",
    "\n",
    "with open('./entities.json') as f:\n",
    "    for line in f:\n",
    "        data.append(json.loads(line))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "22cc4e1c-def8-4621-ba21-acbc3872b67d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'RELATED_ENTITIES': [{'ENTITY_ID': 14802,\n",
      "                       'ERRULE_CODE': 'MFF',\n",
      "                       'IS_AMBIGUOUS': 0,\n",
      "                       'IS_DISCLOSED': 0,\n",
      "                       'MATCH_KEY': '+ADDRESS+GEO_LOC-PLACEKEY',\n",
      "                       'MATCH_LEVEL': 3,\n",
      "                       'MATCH_LEVEL_CODE': 'POSSIBLY_RELATED',\n",
      "                       'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                    'RECORD_ID': '228-223@5yv-j2j-2x5'}]},\n",
      "                      {'ENTITY_ID': 37854,\n",
      "                       'ERRULE_CODE': 'MFF',\n",
      "                       'IS_AMBIGUOUS': 0,\n",
      "                       'IS_DISCLOSED': 0,\n",
      "                       'MATCH_KEY': '+ADDRESS+GEO_LOC-PLACEKEY',\n",
      "                       'MATCH_LEVEL': 3,\n",
      "                       'MATCH_LEVEL_CODE': 'POSSIBLY_RELATED',\n",
      "                       'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                    'RECORD_ID': 'zzw-222@5yv-j2j-2kz'}]},\n",
      "                      {'ENTITY_ID': 52110,\n",
      "                       'ERRULE_CODE': 'CFF',\n",
      "                       'IS_AMBIGUOUS': 0,\n",
      "                       'IS_DISCLOSED': 0,\n",
      "                       'MATCH_KEY': '+GEO_LOC-PLACEKEY',\n",
      "                       'MATCH_LEVEL': 3,\n",
      "                       'MATCH_LEVEL_CODE': 'POSSIBLY_RELATED',\n",
      "                       'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                    'RECORD_ID': 'zzw-22d@5yv-j2j-2kz'}]}],\n",
      " 'RESOLVED_ENTITY': {'ENTITY_ID': 1,\n",
      "                     'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                  'ENTITY_DESC': \"Myle's Nails & Spa\",\n",
      "                                  'ENTITY_KEY': 'E86C65CF09E319D85BE58B3EF8FCB29525B06122',\n",
      "                                  'ENTITY_TYPE': 'GENERIC',\n",
      "                                  'ERRULE_CODE': '',\n",
      "                                  'INTERNAL_ID': 1,\n",
      "                                  'LAST_SEEN_DT': '2024-06-17 14:56:09.956',\n",
      "                                  'MATCH_KEY': '',\n",
      "                                  'MATCH_LEVEL': 0,\n",
      "                                  'MATCH_LEVEL_CODE': '',\n",
      "                                  'RECORD_ID': '228-222@5yv-j2j-2x5'}]}}\n"
     ]
    }
   ],
   "source": [
    "pprint(data[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c527a1df-9269-4c71-865b-4085d5d0ec23",
   "metadata": {},
   "source": [
    "## Resolved entities\n",
    "\n",
    "For ease, I will create a dataframe just of the resolved entities and then one for the related entities.  Note that there can be multiple entities assigned to each resolved entity (see the example 2 lines down).  \n",
    "\n",
    "Note that for ease in visualization (among other things), I am going to create a new node type called `:Entity`, which will contain the resolved entities.  This will serve as a sort of \"anchor node\" for the clusters we will see form in graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8a35b9de-fde0-464a-a62f-61ef19945486",
   "metadata": {},
   "outputs": [],
   "source": [
    "resolved_ls = []\n",
    "\n",
    "for el in data:\n",
    "    if len(el['RESOLVED_ENTITY']['RECORDS']) > 1:\n",
    "        resolved_ls.append(el)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "cbf0c7fb-f882-4c6d-b5a4-39b567fa769b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'RELATED_ENTITIES': [{'ENTITY_ID': 2465,\n",
      "                       'ERRULE_CODE': 'CFF',\n",
      "                       'IS_AMBIGUOUS': 0,\n",
      "                       'IS_DISCLOSED': 0,\n",
      "                       'MATCH_KEY': '+GEO_LOC-PLACEKEY',\n",
      "                       'MATCH_LEVEL': 3,\n",
      "                       'MATCH_LEVEL_CODE': 'POSSIBLY_RELATED',\n",
      "                       'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                    'RECORD_ID': '224-225@5yv-j8b-btv'}]},\n",
      "                      {'ENTITY_ID': 41280,\n",
      "                       'ERRULE_CODE': 'CFF',\n",
      "                       'IS_AMBIGUOUS': 0,\n",
      "                       'IS_DISCLOSED': 0,\n",
      "                       'MATCH_KEY': '+GEO_LOC-PLACEKEY',\n",
      "                       'MATCH_LEVEL': 3,\n",
      "                       'MATCH_LEVEL_CODE': 'POSSIBLY_RELATED',\n",
      "                       'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                    'RECORD_ID': '223-224@5yv-j8b-btv'}]}],\n",
      " 'RESOLVED_ENTITY': {'ENTITY_ID': 436,\n",
      "                     'RECORDS': [{'DATA_SOURCE': 'SAFEGRAPH',\n",
      "                                  'ENTITY_DESC': 'Desert Home Electric',\n",
      "                                  'ENTITY_KEY': 'AD6E9C368743DFD2B68C7BFDE9187137E797ACE0',\n",
      "                                  'ENTITY_TYPE': 'GENERIC',\n",
      "                                  'ERRULE_CODE': '',\n",
      "                                  'INTERNAL_ID': 436,\n",
      "                                  'LAST_SEEN_DT': '2024-06-17 14:52:40.442',\n",
      "                                  'MATCH_KEY': '',\n",
      "                                  'MATCH_LEVEL': 0,\n",
      "                                  'MATCH_LEVEL_CODE': '',\n",
      "                                  'RECORD_ID': '22w-222@5yv-j8b-btv'},\n",
      "                                 {'DATA_SOURCE': 'PPP_LOANS',\n",
      "                                  'ENTITY_DESC': 'DESERT HOME ELECTRIC INC',\n",
      "                                  'ENTITY_KEY': '79A26DF3EC3A6FC9993C9A84410A24915A543089',\n",
      "                                  'ENTITY_TYPE': 'GENERIC',\n",
      "                                  'ERRULE_CODE': 'CNAME_CFF_CEXCL',\n",
      "                                  'INTERNAL_ID': 202066,\n",
      "                                  'LAST_SEEN_DT': '2024-06-17 14:58:19.550',\n",
      "                                  'MATCH_KEY': '+NAME+ADDRESS',\n",
      "                                  'MATCH_LEVEL': 1,\n",
      "                                  'MATCH_LEVEL_CODE': 'RESOLVED',\n",
      "                                  'RECORD_ID': '11784'}]}}\n"
     ]
    }
   ],
   "source": [
    "pprint(resolved_ls[3])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "12e9f17c-ec34-42d6-9992-4507a1a0041c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source_data_source</th>\n",
       "      <th>source_desc</th>\n",
       "      <th>source_uid</th>\n",
       "      <th>target_data_source</th>\n",
       "      <th>target_desc</th>\n",
       "      <th>target_uid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Dona Maria Tamales Restaurant</td>\n",
       "      <td>SAFEGRAPH.zzw-223@5yv-hjr-g8v</td>\n",
       "      <td>PPP_LOANS</td>\n",
       "      <td>DONA MARIA, INC.</td>\n",
       "      <td>PPP_LOANS.8342</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Trigg Laboratories</td>\n",
       "      <td>SAFEGRAPH.226-222@5yv-jb7-5fz</td>\n",
       "      <td>PPP_LOANS</td>\n",
       "      <td>TRIGG LABORATORIES INC</td>\n",
       "      <td>PPP_LOANS.10492</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Vanguard Integrity Professionals</td>\n",
       "      <td>SAFEGRAPH.22c-222@5yv-jbt-k75</td>\n",
       "      <td>DOL_WHISARD</td>\n",
       "      <td>Vanguard Integrity Professionals, Inc.</td>\n",
       "      <td>DOL_WHISARD.210643</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Vanguard Integrity Professionals</td>\n",
       "      <td>SAFEGRAPH.22c-222@5yv-jbt-k75</td>\n",
       "      <td>PPP_LOANS</td>\n",
       "      <td>VANGUARD INTEGRITY PROFESSIONALS NV</td>\n",
       "      <td>PPP_LOANS.7857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Desert Home Electric</td>\n",
       "      <td>SAFEGRAPH.22w-222@5yv-j8b-btv</td>\n",
       "      <td>PPP_LOANS</td>\n",
       "      <td>DESERT HOME ELECTRIC INC</td>\n",
       "      <td>PPP_LOANS.11784</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  source_data_source                       source_desc  \\\n",
       "0          SAFEGRAPH     Dona Maria Tamales Restaurant   \n",
       "1          SAFEGRAPH                Trigg Laboratories   \n",
       "2          SAFEGRAPH  Vanguard Integrity Professionals   \n",
       "3          SAFEGRAPH  Vanguard Integrity Professionals   \n",
       "4          SAFEGRAPH              Desert Home Electric   \n",
       "\n",
       "                      source_uid target_data_source  \\\n",
       "0  SAFEGRAPH.zzw-223@5yv-hjr-g8v          PPP_LOANS   \n",
       "1  SAFEGRAPH.226-222@5yv-jb7-5fz          PPP_LOANS   \n",
       "2  SAFEGRAPH.22c-222@5yv-jbt-k75        DOL_WHISARD   \n",
       "3  SAFEGRAPH.22c-222@5yv-jbt-k75          PPP_LOANS   \n",
       "4  SAFEGRAPH.22w-222@5yv-j8b-btv          PPP_LOANS   \n",
       "\n",
       "                              target_desc          target_uid  \n",
       "0                        DONA MARIA, INC.      PPP_LOANS.8342  \n",
       "1                  TRIGG LABORATORIES INC     PPP_LOANS.10492  \n",
       "2  Vanguard Integrity Professionals, Inc.  DOL_WHISARD.210643  \n",
       "3     VANGUARD INTEGRITY PROFESSIONALS NV      PPP_LOANS.7857  \n",
       "4                DESERT HOME ELECTRIC INC     PPP_LOANS.11784  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tup_ls = []\n",
    "for el in resolved_ls: \n",
    "    source = el['RESOLVED_ENTITY']['RECORDS'][0]\n",
    "    source_uid = str(el['RESOLVED_ENTITY']['RECORDS'][0]['DATA_SOURCE']) + '.' + str(el['RESOLVED_ENTITY']['RECORDS'][0]['RECORD_ID'])\n",
    "    for target in el['RESOLVED_ENTITY']['RECORDS'][1:]:\n",
    "        #tar = target\n",
    "        target_uid = str(target['DATA_SOURCE']) + '.' + str(target['RECORD_ID'])\n",
    "        tup = (el['RESOLVED_ENTITY']['RECORDS'][0]['DATA_SOURCE'],\n",
    "               source['ENTITY_DESC'], \n",
    "               source_uid, \n",
    "               target['DATA_SOURCE'],\n",
    "               target['ENTITY_DESC'], \n",
    "               target_uid)\n",
    "        tup_ls.append(tup)\n",
    "\n",
    "resolved_rel_df = pd.DataFrame(tup_ls, columns=['source_data_source', 'source_desc', 'source_uid',\n",
    "                                                'target_data_source', 'target_desc', 'target_uid'])\n",
    "resolved_rel_df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fb4a13c9-0ac9-4308-b86c-bc13be581f1f",
   "metadata": {},
   "source": [
    "## Related entities\n",
    "\n",
    "Similar to the above we need to create the relationships between the anchor node and the related entities.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "87c3c7d5-2e4c-4c06-9ab5-81221b6aad9c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source_uid</th>\n",
       "      <th>source_data_source</th>\n",
       "      <th>source_desc</th>\n",
       "      <th>target_data_source</th>\n",
       "      <th>match_key</th>\n",
       "      <th>match_level</th>\n",
       "      <th>match_level_code</th>\n",
       "      <th>is_ambiguous</th>\n",
       "      <th>is_disclosed</th>\n",
       "      <th>target_uid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SAFEGRAPH.228-222@5yv-j2j-2x5</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Myle's Nails &amp; Spa</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>+ADDRESS+GEO_LOC-PLACEKEY</td>\n",
       "      <td>3</td>\n",
       "      <td>POSSIBLY_RELATED</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>SAFEGRAPH.228-223@5yv-j2j-2x5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SAFEGRAPH.228-222@5yv-j2j-2x5</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Myle's Nails &amp; Spa</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>+ADDRESS+GEO_LOC-PLACEKEY</td>\n",
       "      <td>3</td>\n",
       "      <td>POSSIBLY_RELATED</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>SAFEGRAPH.zzw-222@5yv-j2j-2kz</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SAFEGRAPH.228-222@5yv-j2j-2x5</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Myle's Nails &amp; Spa</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>+GEO_LOC-PLACEKEY</td>\n",
       "      <td>3</td>\n",
       "      <td>POSSIBLY_RELATED</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>SAFEGRAPH.zzw-22d@5yv-j2j-2kz</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SAFEGRAPH.225-222@5yv-j92-tn5</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Cantwell Michelle L Atty</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>+ADDRESS+PHONE+GEO_LOC-PLACEKEY</td>\n",
       "      <td>3</td>\n",
       "      <td>POSSIBLY_RELATED</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>SAFEGRAPH.225-22d@5yv-j92-tn5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SAFEGRAPH.225-222@5yv-j92-tn5</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Cantwell Michelle L Atty</td>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>+ADDRESS+GEO_LOC-PLACEKEY</td>\n",
       "      <td>3</td>\n",
       "      <td>POSSIBLY_RELATED</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>SAFEGRAPH.225-225@5yv-j92-tn5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      source_uid source_data_source               source_desc  \\\n",
       "0  SAFEGRAPH.228-222@5yv-j2j-2x5          SAFEGRAPH        Myle's Nails & Spa   \n",
       "1  SAFEGRAPH.228-222@5yv-j2j-2x5          SAFEGRAPH        Myle's Nails & Spa   \n",
       "2  SAFEGRAPH.228-222@5yv-j2j-2x5          SAFEGRAPH        Myle's Nails & Spa   \n",
       "3  SAFEGRAPH.225-222@5yv-j92-tn5          SAFEGRAPH  Cantwell Michelle L Atty   \n",
       "4  SAFEGRAPH.225-222@5yv-j92-tn5          SAFEGRAPH  Cantwell Michelle L Atty   \n",
       "\n",
       "  target_data_source                        match_key  match_level  \\\n",
       "0          SAFEGRAPH        +ADDRESS+GEO_LOC-PLACEKEY            3   \n",
       "1          SAFEGRAPH        +ADDRESS+GEO_LOC-PLACEKEY            3   \n",
       "2          SAFEGRAPH                +GEO_LOC-PLACEKEY            3   \n",
       "3          SAFEGRAPH  +ADDRESS+PHONE+GEO_LOC-PLACEKEY            3   \n",
       "4          SAFEGRAPH        +ADDRESS+GEO_LOC-PLACEKEY            3   \n",
       "\n",
       "   match_level_code  is_ambiguous  is_disclosed                     target_uid  \n",
       "0  POSSIBLY_RELATED             0             0  SAFEGRAPH.228-223@5yv-j2j-2x5  \n",
       "1  POSSIBLY_RELATED             0             0  SAFEGRAPH.zzw-222@5yv-j2j-2kz  \n",
       "2  POSSIBLY_RELATED             0             0  SAFEGRAPH.zzw-22d@5yv-j2j-2kz  \n",
       "3  POSSIBLY_RELATED             0             0  SAFEGRAPH.225-22d@5yv-j92-tn5  \n",
       "4  POSSIBLY_RELATED             0             0  SAFEGRAPH.225-225@5yv-j92-tn5  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tup_ls = []\n",
    "\n",
    "for el in data:\n",
    "    #pprint(el)\n",
    "    source = el['RESOLVED_ENTITY']['RECORDS'][0]\n",
    "    source_data_source = source['DATA_SOURCE']\n",
    "    source_desc = source['ENTITY_DESC']\n",
    "    source_uid = str(source_data_source) + '.' + str(source['RECORD_ID'])\n",
    "    for target in el['RELATED_ENTITIES']:\n",
    "        for la in target['RECORDS']:\n",
    "            target_uid = str(la['DATA_SOURCE']) + '.' + str(la['RECORD_ID'])\n",
    "            tup = (source_uid,\n",
    "                   source_data_source,\n",
    "                   source_desc,\n",
    "                   la['DATA_SOURCE'],\n",
    "                   target['MATCH_KEY'],\n",
    "                   target['MATCH_LEVEL'],\n",
    "                   target['MATCH_LEVEL_CODE'],\n",
    "                   target['IS_AMBIGUOUS'],\n",
    "                   target['IS_DISCLOSED'],\n",
    "                   target_uid)\n",
    "            tup_ls.append(tup)\n",
    "\n",
    "related_rel_df = pd.DataFrame(tup_ls, columns=['source_uid', 'source_data_source', 'source_desc', \n",
    "                                           'target_data_source', 'match_key', 'match_level', 'match_level_code', 'is_ambiguous',\n",
    "                                           'is_disclosed', 'target_uid'])\n",
    "related_rel_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "0f282b97-03df-46ac-a3b8-e4442e6b0f4d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((1600, 6), (351405, 10))"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resolved_rel_df.shape, related_rel_df.shape"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "faf46823-63da-4b9b-a72f-263499bbda84",
   "metadata": {},
   "source": [
    "### About this bit\n",
    "\n",
    "This is where we set up the actual `:Entity`/anchor nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "80a19e98-483e-4c92-9aa6-07ba1ecf0dfa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((1600, 3), (1386, 3))"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "keep_columns = ['source_data_source', 'source_desc', 'source_uid']\n",
    "ent_df = resolved_rel_df[keep_columns]\n",
    "ent_df_dedup = ent_df.drop_duplicates()\n",
    "ent_df.shape, ent_df_dedup.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "917553bd-4727-43af-8fc5-dea8cb53b791",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source_data_source</th>\n",
       "      <th>source_desc</th>\n",
       "      <th>source_uid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Dona Maria Tamales Restaurant</td>\n",
       "      <td>SAFEGRAPH.zzw-223@5yv-hjr-g8v</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Trigg Laboratories</td>\n",
       "      <td>SAFEGRAPH.226-222@5yv-jb7-5fz</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Vanguard Integrity Professionals</td>\n",
       "      <td>SAFEGRAPH.22c-222@5yv-jbt-k75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>Desert Home Electric</td>\n",
       "      <td>SAFEGRAPH.22w-222@5yv-j8b-btv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>SAFEGRAPH</td>\n",
       "      <td>A To Z Environmental Services</td>\n",
       "      <td>SAFEGRAPH.223-222@5yv-jb6-6kz</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  source_data_source                       source_desc  \\\n",
       "0          SAFEGRAPH     Dona Maria Tamales Restaurant   \n",
       "1          SAFEGRAPH                Trigg Laboratories   \n",
       "2          SAFEGRAPH  Vanguard Integrity Professionals   \n",
       "4          SAFEGRAPH              Desert Home Electric   \n",
       "5          SAFEGRAPH     A To Z Environmental Services   \n",
       "\n",
       "                      source_uid  \n",
       "0  SAFEGRAPH.zzw-223@5yv-hjr-g8v  \n",
       "1  SAFEGRAPH.226-222@5yv-jb7-5fz  \n",
       "2  SAFEGRAPH.22c-222@5yv-jbt-k75  \n",
       "4  SAFEGRAPH.22w-222@5yv-j8b-btv  \n",
       "5  SAFEGRAPH.223-222@5yv-jb6-6kz  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ent_df_dedup.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "595a110e-7962-4482-ad37-545d0239b26a",
   "metadata": {},
   "source": [
    "## Establish connection to Neo4j\n",
    "\n",
    "You could be running Neo4j in any variety of places. This demo shows running it locally. However, if you are hosting it somewhere else, replace the bolt address with yours. Also update your password below."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "89d6dcd7-83f2-46ac-8b49-04074ccba0b1",
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"bolt://localhost:7687\"\n",
    "USER = \"neo4j\"\n",
    "PWD = \" \" # Put your password here\n",
    "AUTH = (USER, PWD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "8c91cf19-f99e-4358-86f1-5148e5d1ec26",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response\n",
    "        \n",
    "\n",
    "def insert_data(query, rows, batch_size=1000):\n",
    "\n",
    "    total = 0\n",
    "    batch = 0\n",
    "    start = time.time()\n",
    "    result = None\n",
    "    \n",
    "    while batch * batch_size < len(rows):\n",
    "\n",
    "        res = neo_conn.query(query, \n",
    "                             parameters = {'rows': rows[batch*batch_size:(batch+1)*batch_size].to_dict('records')})\n",
    "        total += res[0]['total']\n",
    "        batch += 1\n",
    "        result = {\"total\":total, \n",
    "                  \"batches\":batch, \n",
    "                  \"time\":time.time()-start}\n",
    "        print(result)\n",
    "        \n",
    "    return result\n",
    "\n",
    "\n",
    "neo_conn = Neo4jConnection(uri=URI, user=USER, pwd=PWD)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "10bd56ba-ec09-4220-bbe5-dfe8e5b2184a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo_conn.query('CREATE CONSTRAINT ent IF NOT EXISTS FOR (e:Entity) REQUIRE e.uid IS UNIQUE')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "dccee03d-bb44-41d6-95be-ad4364af66a2",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_ent(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MERGE (:Entity {uid: row.source_uid,\n",
    "                               name: row.source_desc,\n",
    "                               data_source: row.source_data_source})\n",
    "               RETURN count(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_ent_rel(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MATCH (source {uid: row.source_uid})\n",
    "               MATCH (target {uid: row.target_uid})\n",
    "               MERGE (source)-[:RESOLVES]->(target)\n",
    "               RETURN count(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_sg_related_rel(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MATCH (source:Entity {uid: row.source_uid})\n",
    "               MATCH (target:SGEntity {uid:row.target_uid})\n",
    "               MERGE (target)-[:RELATED_TO {match_key: row.match_key,\n",
    "                                            match_level: row.match_level,\n",
    "                                            match_level_code: row.match_level_code,\n",
    "                                            is_ambiguous: row.is_ambiguous,\n",
    "                                            is_disclosed: row.is_disclosed}]->(source)\n",
    "               RETURN count(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_dol_related_rel(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MATCH (source:Entity {uid: row.source_uid})\n",
    "               MATCH (target:DOLEntity {uid:row.target_uid})\n",
    "               MERGE (target)-[:RELATED_TO {match_key: row.match_key,\n",
    "                                            match_level: row.match_level,\n",
    "                                            match_level_code: row.match_level_code,\n",
    "                                            is_ambiguous: row.is_ambiguous,\n",
    "                                            is_disclosed: row.is_disclosed}]->(source)\n",
    "               RETURN count(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)    \n",
    "\n",
    "def add_ppp_related_rel(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MATCH (source:Entity {uid: row.source_uid})\n",
    "               MATCH (target:PPPEntity {uid:row.target_uid})\n",
    "               MERGE (target)-[:RELATED_TO {match_key: row.match_key,\n",
    "                                            match_level: row.match_level,\n",
    "                                            match_level_code: row.match_level_code,\n",
    "                                            is_ambiguous: row.is_ambiguous,\n",
    "                                            is_disclosed: row.is_disclosed}]->(source)\n",
    "               RETURN count(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "05b5c2df-46f4-49fc-bc65-e1dc8b3ecfc3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1000, 'batches': 1, 'time': 0.047647714614868164}\n",
      "{'total': 1386, 'batches': 2, 'time': 0.06178855895996094}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 1386, 'batches': 2, 'time': 0.06178855895996094}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_ent(ent_df_dedup)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "544f6604-40fe-4b93-bf27-8012911ca900",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 100, 'batches': 1, 'time': 8.016542673110962}\n",
      "{'total': 200, 'batches': 2, 'time': 16.055448293685913}\n",
      "{'total': 300, 'batches': 3, 'time': 23.836010456085205}\n",
      "{'total': 400, 'batches': 4, 'time': 31.941528797149658}\n",
      "{'total': 500, 'batches': 5, 'time': 39.81591296195984}\n",
      "{'total': 600, 'batches': 6, 'time': 47.602574586868286}\n",
      "{'total': 700, 'batches': 7, 'time': 55.490866899490356}\n",
      "{'total': 800, 'batches': 8, 'time': 63.43989014625549}\n",
      "{'total': 900, 'batches': 9, 'time': 71.24176001548767}\n",
      "{'total': 1000, 'batches': 10, 'time': 78.86564373970032}\n",
      "{'total': 1100, 'batches': 11, 'time': 86.59602928161621}\n",
      "{'total': 1200, 'batches': 12, 'time': 94.68604636192322}\n",
      "{'total': 1300, 'batches': 13, 'time': 102.57813143730164}\n",
      "{'total': 1400, 'batches': 14, 'time': 110.15722584724426}\n",
      "{'total': 1500, 'batches': 15, 'time': 117.84597706794739}\n",
      "{'total': 1600, 'batches': 16, 'time': 125.77107906341553}\n",
      "{'total': 1700, 'batches': 17, 'time': 133.60603499412537}\n",
      "{'total': 1800, 'batches': 18, 'time': 141.61954188346863}\n",
      "{'total': 1900, 'batches': 19, 'time': 149.4252631664276}\n",
      "{'total': 2000, 'batches': 20, 'time': 157.11060976982117}\n",
      "{'total': 2100, 'batches': 21, 'time': 164.77299404144287}\n",
      "{'total': 2200, 'batches': 22, 'time': 172.49627900123596}\n",
      "{'total': 2300, 'batches': 23, 'time': 180.00837349891663}\n",
      "{'total': 2400, 'batches': 24, 'time': 187.5579319000244}\n",
      "{'total': 2500, 'batches': 25, 'time': 195.0420742034912}\n",
      "{'total': 2600, 'batches': 26, 'time': 203.14369583129883}\n",
      "{'total': 2700, 'batches': 27, 'time': 210.9453637599945}\n",
      "{'total': 2800, 'batches': 28, 'time': 218.6248106956482}\n",
      "{'total': 2900, 'batches': 29, 'time': 226.52422094345093}\n",
      "{'total': 3000, 'batches': 30, 'time': 234.2563283443451}\n",
      "{'total': 3100, 'batches': 31, 'time': 241.79617476463318}\n",
      "{'total': 3200, 'batches': 32, 'time': 249.40752577781677}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 3200, 'batches': 32, 'time': 249.40752577781677}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_ent_rel(resolved_rel_df, batch_size=50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "6fe4b3cc-9c5c-4467-83a3-1b57613e9c08",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((340093, 10), (4948, 10), (6364, 10))"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sg_related_rel_df = related_rel_df[related_rel_df['target_data_source']==\"SAFEGRAPH\"]\n",
    "dol_related_rel_df = related_rel_df[related_rel_df['target_data_source']==\"DOL_WHISARD\"]\n",
    "ppp_related_rel_df = related_rel_df[related_rel_df['target_data_source']==\"PPP_LOANS\"]\n",
    "sg_related_rel_df.shape, dol_related_rel_df.shape, ppp_related_rel_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "3d2df313-29d5-4ac9-9e4c-cdf20f499551",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1, 'batches': 1, 'time': 0.07312226295471191}\n",
      "{'total': 3, 'batches': 2, 'time': 0.1231985092163086}\n",
      "{'total': 6, 'batches': 3, 'time': 0.17707228660583496}\n",
      "{'total': 29, 'batches': 4, 'time': 0.2375621795654297}\n",
      "{'total': 50, 'batches': 5, 'time': 0.2921774387359619}\n",
      "{'total': 54, 'batches': 6, 'time': 0.3450784683227539}\n",
      "{'total': 72, 'batches': 7, 'time': 0.3923454284667969}\n",
      "{'total': 81, 'batches': 8, 'time': 0.43192172050476074}\n",
      "{'total': 89, 'batches': 9, 'time': 0.4686744213104248}\n",
      "{'total': 92, 'batches': 10, 'time': 0.5031101703643799}\n",
      "{'total': 94, 'batches': 11, 'time': 0.5441758632659912}\n",
      "{'total': 95, 'batches': 12, 'time': 0.5782947540283203}\n",
      "{'total': 95, 'batches': 13, 'time': 0.6120483875274658}\n",
      "{'total': 103, 'batches': 14, 'time': 0.6489179134368896}\n",
      "{'total': 106, 'batches': 15, 'time': 0.6838831901550293}\n",
      "{'total': 317, 'batches': 16, 'time': 0.7231006622314453}\n",
      "{'total': 329, 'batches': 17, 'time': 0.7600753307342529}\n",
      "{'total': 329, 'batches': 18, 'time': 0.7934086322784424}\n",
      "{'total': 331, 'batches': 19, 'time': 0.8276855945587158}\n",
      "{'total': 335, 'batches': 20, 'time': 0.8620507717132568}\n",
      "{'total': 358, 'batches': 21, 'time': 0.897327184677124}\n",
      "{'total': 358, 'batches': 22, 'time': 0.9304912090301514}\n",
      "{'total': 367, 'batches': 23, 'time': 0.9688215255737305}\n",
      "{'total': 377, 'batches': 24, 'time': 1.0056817531585693}\n",
      "{'total': 447, 'batches': 25, 'time': 1.0443968772888184}\n",
      "{'total': 461, 'batches': 26, 'time': 1.0817680358886719}\n",
      "{'total': 468, 'batches': 27, 'time': 1.1162409782409668}\n",
      "{'total': 472, 'batches': 28, 'time': 1.152991771697998}\n",
      "{'total': 481, 'batches': 29, 'time': 1.1910216808319092}\n",
      "{'total': 493, 'batches': 30, 'time': 1.2273530960083008}\n",
      "{'total': 512, 'batches': 31, 'time': 1.2624132633209229}\n",
      "{'total': 512, 'batches': 32, 'time': 1.2957451343536377}\n",
      "{'total': 568, 'batches': 33, 'time': 1.331071376800537}\n",
      "{'total': 570, 'batches': 34, 'time': 1.3648314476013184}\n",
      "{'total': 579, 'batches': 35, 'time': 1.404228687286377}\n",
      "{'total': 588, 'batches': 36, 'time': 1.4392805099487305}\n",
      "{'total': 588, 'batches': 37, 'time': 1.4722013473510742}\n",
      "{'total': 601, 'batches': 38, 'time': 1.5074236392974854}\n",
      "{'total': 626, 'batches': 39, 'time': 1.5438945293426514}\n",
      "{'total': 644, 'batches': 40, 'time': 1.5792055130004883}\n",
      "{'total': 650, 'batches': 41, 'time': 1.6150939464569092}\n",
      "{'total': 650, 'batches': 42, 'time': 1.6482086181640625}\n",
      "{'total': 673, 'batches': 43, 'time': 1.683218002319336}\n",
      "{'total': 690, 'batches': 44, 'time': 1.718212366104126}\n",
      "{'total': 734, 'batches': 45, 'time': 1.7534632682800293}\n",
      "{'total': 738, 'batches': 46, 'time': 1.7884235382080078}\n",
      "{'total': 754, 'batches': 47, 'time': 1.824369192123413}\n",
      "{'total': 780, 'batches': 48, 'time': 1.8610291481018066}\n",
      "{'total': 847, 'batches': 49, 'time': 1.8979294300079346}\n",
      "{'total': 850, 'batches': 50, 'time': 1.9338345527648926}\n",
      "{'total': 857, 'batches': 51, 'time': 1.9703667163848877}\n",
      "{'total': 866, 'batches': 52, 'time': 2.0078046321868896}\n",
      "{'total': 880, 'batches': 53, 'time': 2.0448570251464844}\n",
      "{'total': 884, 'batches': 54, 'time': 2.081451416015625}\n",
      "{'total': 901, 'batches': 55, 'time': 2.1160717010498047}\n",
      "{'total': 911, 'batches': 56, 'time': 2.150883197784424}\n",
      "{'total': 929, 'batches': 57, 'time': 2.18629789352417}\n",
      "{'total': 940, 'batches': 58, 'time': 2.2210094928741455}\n",
      "{'total': 945, 'batches': 59, 'time': 2.259381055831909}\n",
      "{'total': 958, 'batches': 60, 'time': 2.2954790592193604}\n",
      "{'total': 958, 'batches': 61, 'time': 2.32846999168396}\n",
      "{'total': 979, 'batches': 62, 'time': 2.363837718963623}\n",
      "{'total': 993, 'batches': 63, 'time': 2.4000942707061768}\n",
      "{'total': 1011, 'batches': 64, 'time': 2.4362998008728027}\n",
      "{'total': 1026, 'batches': 65, 'time': 2.4747321605682373}\n",
      "{'total': 1029, 'batches': 66, 'time': 2.5100510120391846}\n",
      "{'total': 1036, 'batches': 67, 'time': 2.5437023639678955}\n",
      "{'total': 1067, 'batches': 68, 'time': 2.5789802074432373}\n",
      "{'total': 1078, 'batches': 69, 'time': 2.614489793777466}\n",
      "{'total': 1143, 'batches': 70, 'time': 2.650315999984741}\n",
      "{'total': 1154, 'batches': 71, 'time': 2.6871612071990967}\n",
      "{'total': 1167, 'batches': 72, 'time': 2.7227110862731934}\n",
      "{'total': 1169, 'batches': 73, 'time': 2.758538007736206}\n",
      "{'total': 1171, 'batches': 74, 'time': 2.793994188308716}\n",
      "{'total': 1199, 'batches': 75, 'time': 2.8292236328125}\n",
      "{'total': 1199, 'batches': 76, 'time': 2.8629631996154785}\n",
      "{'total': 1203, 'batches': 77, 'time': 2.899641752243042}\n",
      "{'total': 1209, 'batches': 78, 'time': 2.9343018531799316}\n",
      "{'total': 1215, 'batches': 79, 'time': 2.969058036804199}\n",
      "{'total': 1230, 'batches': 80, 'time': 3.0047311782836914}\n",
      "{'total': 1268, 'batches': 81, 'time': 3.0407791137695312}\n",
      "{'total': 1285, 'batches': 82, 'time': 3.0766103267669678}\n",
      "{'total': 1288, 'batches': 83, 'time': 3.1128361225128174}\n",
      "{'total': 1306, 'batches': 84, 'time': 3.148897647857666}\n",
      "{'total': 1306, 'batches': 85, 'time': 3.1826772689819336}\n",
      "{'total': 1364, 'batches': 86, 'time': 3.219825029373169}\n",
      "{'total': 1385, 'batches': 87, 'time': 3.2560102939605713}\n",
      "{'total': 1391, 'batches': 88, 'time': 3.2912251949310303}\n",
      "{'total': 1396, 'batches': 89, 'time': 3.329202175140381}\n",
      "{'total': 1408, 'batches': 90, 'time': 3.366063117980957}\n",
      "{'total': 1415, 'batches': 91, 'time': 3.4036519527435303}\n",
      "{'total': 1428, 'batches': 92, 'time': 3.4393272399902344}\n",
      "{'total': 1449, 'batches': 93, 'time': 3.4747936725616455}\n",
      "{'total': 1670, 'batches': 94, 'time': 3.513615846633911}\n",
      "{'total': 1680, 'batches': 95, 'time': 3.5500452518463135}\n",
      "{'total': 1685, 'batches': 96, 'time': 3.583981513977051}\n",
      "{'total': 1704, 'batches': 97, 'time': 3.6197121143341064}\n",
      "{'total': 1715, 'batches': 98, 'time': 3.6558752059936523}\n",
      "{'total': 1717, 'batches': 99, 'time': 3.691098690032959}\n",
      "{'total': 1729, 'batches': 100, 'time': 3.7268154621124268}\n",
      "{'total': 1733, 'batches': 101, 'time': 3.764401435852051}\n",
      "{'total': 1736, 'batches': 102, 'time': 3.798469305038452}\n",
      "{'total': 1778, 'batches': 103, 'time': 3.8343687057495117}\n",
      "{'total': 1813, 'batches': 104, 'time': 3.8700807094573975}\n",
      "{'total': 1836, 'batches': 105, 'time': 3.9056239128112793}\n",
      "{'total': 1847, 'batches': 106, 'time': 3.9418487548828125}\n",
      "{'total': 1865, 'batches': 107, 'time': 3.9799094200134277}\n",
      "{'total': 1865, 'batches': 108, 'time': 4.013216972351074}\n",
      "{'total': 1889, 'batches': 109, 'time': 4.0483078956604}\n",
      "{'total': 1908, 'batches': 110, 'time': 4.083799600601196}\n",
      "{'total': 1913, 'batches': 111, 'time': 4.118763208389282}\n",
      "{'total': 1913, 'batches': 112, 'time': 4.152255535125732}\n",
      "{'total': 1922, 'batches': 113, 'time': 4.189535856246948}\n",
      "{'total': 1925, 'batches': 114, 'time': 4.223988771438599}\n",
      "{'total': 1930, 'batches': 115, 'time': 4.2598278522491455}\n",
      "{'total': 1941, 'batches': 116, 'time': 4.295634508132935}\n",
      "{'total': 1947, 'batches': 117, 'time': 4.331217527389526}\n",
      "{'total': 2003, 'batches': 118, 'time': 4.367920637130737}\n",
      "{'total': 2016, 'batches': 119, 'time': 4.407055139541626}\n",
      "{'total': 2031, 'batches': 120, 'time': 4.442537546157837}\n",
      "{'total': 2040, 'batches': 121, 'time': 4.477726936340332}\n",
      "{'total': 2048, 'batches': 122, 'time': 4.513080358505249}\n",
      "{'total': 2059, 'batches': 123, 'time': 4.547898769378662}\n",
      "{'total': 2064, 'batches': 124, 'time': 4.584784030914307}\n",
      "{'total': 2070, 'batches': 125, 'time': 4.625686168670654}\n",
      "{'total': 2070, 'batches': 126, 'time': 4.664006233215332}\n",
      "{'total': 2082, 'batches': 127, 'time': 4.701970100402832}\n",
      "{'total': 2097, 'batches': 128, 'time': 4.739593029022217}\n",
      "{'total': 2109, 'batches': 129, 'time': 4.775898456573486}\n",
      "{'total': 2110, 'batches': 130, 'time': 4.811652898788452}\n",
      "{'total': 2121, 'batches': 131, 'time': 4.84779953956604}\n",
      "{'total': 2135, 'batches': 132, 'time': 4.883875131607056}\n",
      "{'total': 2145, 'batches': 133, 'time': 4.919479131698608}\n",
      "{'total': 2146, 'batches': 134, 'time': 4.953689098358154}\n",
      "{'total': 2156, 'batches': 135, 'time': 4.989269733428955}\n",
      "{'total': 2158, 'batches': 136, 'time': 5.024137020111084}\n",
      "{'total': 2161, 'batches': 137, 'time': 5.059888124465942}\n",
      "{'total': 2167, 'batches': 138, 'time': 5.094655990600586}\n",
      "{'total': 2168, 'batches': 139, 'time': 5.129359245300293}\n",
      "{'total': 2195, 'batches': 140, 'time': 5.164195775985718}\n",
      "{'total': 2212, 'batches': 141, 'time': 5.199403762817383}\n",
      "{'total': 2246, 'batches': 142, 'time': 5.235230207443237}\n",
      "{'total': 2249, 'batches': 143, 'time': 5.270873069763184}\n",
      "{'total': 2263, 'batches': 144, 'time': 5.305737495422363}\n",
      "{'total': 2283, 'batches': 145, 'time': 5.339935064315796}\n",
      "{'total': 2284, 'batches': 146, 'time': 5.373556613922119}\n",
      "{'total': 2296, 'batches': 147, 'time': 5.408038139343262}\n",
      "{'total': 2305, 'batches': 148, 'time': 5.445380926132202}\n",
      "{'total': 2319, 'batches': 149, 'time': 5.486176252365112}\n",
      "{'total': 2324, 'batches': 150, 'time': 5.528533458709717}\n",
      "{'total': 2324, 'batches': 151, 'time': 5.5722668170928955}\n",
      "{'total': 2345, 'batches': 152, 'time': 5.619251251220703}\n",
      "{'total': 2351, 'batches': 153, 'time': 5.665961742401123}\n",
      "{'total': 2366, 'batches': 154, 'time': 5.713984966278076}\n",
      "{'total': 2370, 'batches': 155, 'time': 5.758012294769287}\n",
      "{'total': 2370, 'batches': 156, 'time': 5.800629377365112}\n",
      "{'total': 2383, 'batches': 157, 'time': 5.8419029712677}\n",
      "{'total': 2392, 'batches': 158, 'time': 5.879128456115723}\n",
      "{'total': 2395, 'batches': 159, 'time': 5.9174933433532715}\n",
      "{'total': 2404, 'batches': 160, 'time': 5.958035230636597}\n",
      "{'total': 2413, 'batches': 161, 'time': 5.99616003036499}\n",
      "{'total': 2427, 'batches': 162, 'time': 6.0337114334106445}\n",
      "{'total': 2428, 'batches': 163, 'time': 6.07127571105957}\n",
      "{'total': 2438, 'batches': 164, 'time': 6.109561204910278}\n",
      "{'total': 2451, 'batches': 165, 'time': 6.148634672164917}\n",
      "{'total': 2469, 'batches': 166, 'time': 6.184873342514038}\n",
      "{'total': 2470, 'batches': 167, 'time': 6.220572233200073}\n",
      "{'total': 2483, 'batches': 168, 'time': 6.256209373474121}\n",
      "{'total': 2483, 'batches': 169, 'time': 6.29070782661438}\n",
      "{'total': 2778, 'batches': 170, 'time': 6.332613468170166}\n",
      "{'total': 2788, 'batches': 171, 'time': 6.370580434799194}\n",
      "{'total': 2791, 'batches': 172, 'time': 6.407573938369751}\n",
      "{'total': 2794, 'batches': 173, 'time': 6.444938898086548}\n",
      "{'total': 2802, 'batches': 174, 'time': 6.482794523239136}\n",
      "{'total': 2817, 'batches': 175, 'time': 6.520161390304565}\n",
      "{'total': 2830, 'batches': 176, 'time': 6.557497978210449}\n",
      "{'total': 2837, 'batches': 177, 'time': 6.594942808151245}\n",
      "{'total': 2845, 'batches': 178, 'time': 6.630154848098755}\n",
      "{'total': 2848, 'batches': 179, 'time': 6.666823625564575}\n",
      "{'total': 2852, 'batches': 180, 'time': 6.703165292739868}\n",
      "{'total': 2854, 'batches': 181, 'time': 6.7404139041900635}\n",
      "{'total': 2866, 'batches': 182, 'time': 6.779792785644531}\n",
      "{'total': 2869, 'batches': 183, 'time': 6.818423748016357}\n",
      "{'total': 2874, 'batches': 184, 'time': 6.8556132316589355}\n",
      "{'total': 2887, 'batches': 185, 'time': 6.892754316329956}\n",
      "{'total': 2966, 'batches': 186, 'time': 6.929845809936523}\n",
      "{'total': 2972, 'batches': 187, 'time': 6.965277671813965}\n",
      "{'total': 2992, 'batches': 188, 'time': 7.002905607223511}\n",
      "{'total': 3002, 'batches': 189, 'time': 7.039486408233643}\n",
      "{'total': 3003, 'batches': 190, 'time': 7.0762670040130615}\n",
      "{'total': 3011, 'batches': 191, 'time': 7.113814115524292}\n",
      "{'total': 3027, 'batches': 192, 'time': 7.151562690734863}\n",
      "{'total': 3047, 'batches': 193, 'time': 7.189860105514526}\n",
      "{'total': 3052, 'batches': 194, 'time': 7.230870962142944}\n",
      "{'total': 3095, 'batches': 195, 'time': 7.26639723777771}\n",
      "{'total': 3097, 'batches': 196, 'time': 7.301290273666382}\n",
      "{'total': 3111, 'batches': 197, 'time': 7.336170196533203}\n",
      "{'total': 3113, 'batches': 198, 'time': 7.376544713973999}\n",
      "{'total': 3126, 'batches': 199, 'time': 7.414053440093994}\n",
      "{'total': 3130, 'batches': 200, 'time': 7.450832366943359}\n",
      "{'total': 3131, 'batches': 201, 'time': 7.487205505371094}\n",
      "{'total': 3142, 'batches': 202, 'time': 7.5245747566223145}\n",
      "{'total': 3147, 'batches': 203, 'time': 7.559959888458252}\n",
      "{'total': 3165, 'batches': 204, 'time': 7.59546422958374}\n",
      "{'total': 3205, 'batches': 205, 'time': 7.631083011627197}\n",
      "{'total': 3207, 'batches': 206, 'time': 7.6666553020477295}\n",
      "{'total': 3209, 'batches': 207, 'time': 7.703237056732178}\n",
      "{'total': 3220, 'batches': 208, 'time': 7.746762275695801}\n",
      "{'total': 3221, 'batches': 209, 'time': 7.793485403060913}\n",
      "{'total': 3230, 'batches': 210, 'time': 7.835324764251709}\n",
      "{'total': 3241, 'batches': 211, 'time': 7.872453451156616}\n",
      "{'total': 3257, 'batches': 212, 'time': 7.910388231277466}\n",
      "{'total': 3279, 'batches': 213, 'time': 7.946292877197266}\n",
      "{'total': 3297, 'batches': 214, 'time': 7.983557224273682}\n",
      "{'total': 3300, 'batches': 215, 'time': 8.030646085739136}\n",
      "{'total': 3324, 'batches': 216, 'time': 8.078501224517822}\n",
      "{'total': 3337, 'batches': 217, 'time': 8.125148296356201}\n",
      "{'total': 3348, 'batches': 218, 'time': 8.162705421447754}\n",
      "{'total': 3354, 'batches': 219, 'time': 8.197843074798584}\n",
      "{'total': 3354, 'batches': 220, 'time': 8.231291770935059}\n",
      "{'total': 3356, 'batches': 221, 'time': 8.266538143157959}\n",
      "{'total': 3367, 'batches': 222, 'time': 8.302315473556519}\n",
      "{'total': 3376, 'batches': 223, 'time': 8.340133428573608}\n",
      "{'total': 3376, 'batches': 224, 'time': 8.3776216506958}\n",
      "{'total': 3377, 'batches': 225, 'time': 8.416476488113403}\n",
      "{'total': 3416, 'batches': 226, 'time': 8.45591688156128}\n",
      "{'total': 3420, 'batches': 227, 'time': 8.492013931274414}\n",
      "{'total': 3429, 'batches': 228, 'time': 8.528427124023438}\n",
      "{'total': 3467, 'batches': 229, 'time': 8.564830780029297}\n",
      "{'total': 3491, 'batches': 230, 'time': 8.602092266082764}\n",
      "{'total': 3499, 'batches': 231, 'time': 8.64054274559021}\n",
      "{'total': 3518, 'batches': 232, 'time': 8.683016538619995}\n",
      "{'total': 3529, 'batches': 233, 'time': 8.722208261489868}\n",
      "{'total': 3551, 'batches': 234, 'time': 8.761142253875732}\n",
      "{'total': 3575, 'batches': 235, 'time': 8.798762083053589}\n",
      "{'total': 3590, 'batches': 236, 'time': 8.835563659667969}\n",
      "{'total': 3600, 'batches': 237, 'time': 8.871047019958496}\n",
      "{'total': 3614, 'batches': 238, 'time': 8.908691167831421}\n",
      "{'total': 3621, 'batches': 239, 'time': 8.947712182998657}\n",
      "{'total': 3627, 'batches': 240, 'time': 8.987104415893555}\n",
      "{'total': 3660, 'batches': 241, 'time': 9.027076721191406}\n",
      "{'total': 3675, 'batches': 242, 'time': 9.065627098083496}\n",
      "{'total': 3683, 'batches': 243, 'time': 9.102030992507935}\n",
      "{'total': 3697, 'batches': 244, 'time': 9.138391733169556}\n",
      "{'total': 3706, 'batches': 245, 'time': 9.174737691879272}\n",
      "{'total': 3713, 'batches': 246, 'time': 9.212894439697266}\n",
      "{'total': 3734, 'batches': 247, 'time': 9.252025365829468}\n",
      "{'total': 3742, 'batches': 248, 'time': 9.2898690700531}\n",
      "{'total': 3744, 'batches': 249, 'time': 9.327390193939209}\n",
      "{'total': 3758, 'batches': 250, 'time': 9.365043640136719}\n",
      "{'total': 3768, 'batches': 251, 'time': 9.401170492172241}\n",
      "{'total': 3776, 'batches': 252, 'time': 9.436831951141357}\n",
      "{'total': 3787, 'batches': 253, 'time': 9.47415828704834}\n",
      "{'total': 3795, 'batches': 254, 'time': 9.51098895072937}\n",
      "{'total': 3797, 'batches': 255, 'time': 9.546409368515015}\n",
      "{'total': 3815, 'batches': 256, 'time': 9.584407329559326}\n",
      "{'total': 3837, 'batches': 257, 'time': 9.622122287750244}\n",
      "{'total': 3847, 'batches': 258, 'time': 9.660987615585327}\n",
      "{'total': 3857, 'batches': 259, 'time': 9.698745965957642}\n",
      "{'total': 3868, 'batches': 260, 'time': 9.738548040390015}\n",
      "{'total': 3874, 'batches': 261, 'time': 9.778079271316528}\n",
      "{'total': 3881, 'batches': 262, 'time': 9.816293239593506}\n",
      "{'total': 3891, 'batches': 263, 'time': 9.853614330291748}\n",
      "{'total': 3897, 'batches': 264, 'time': 9.889886140823364}\n",
      "{'total': 3923, 'batches': 265, 'time': 9.927296876907349}\n",
      "{'total': 3930, 'batches': 266, 'time': 9.96451997756958}\n",
      "{'total': 3946, 'batches': 267, 'time': 10.001744985580444}\n",
      "{'total': 3947, 'batches': 268, 'time': 10.036914825439453}\n",
      "{'total': 3953, 'batches': 269, 'time': 10.10023546218872}\n",
      "{'total': 3965, 'batches': 270, 'time': 10.135857820510864}\n",
      "{'total': 3976, 'batches': 271, 'time': 10.174021244049072}\n",
      "{'total': 3982, 'batches': 272, 'time': 10.210535049438477}\n",
      "{'total': 3994, 'batches': 273, 'time': 10.247135162353516}\n",
      "{'total': 3997, 'batches': 274, 'time': 10.284275531768799}\n",
      "{'total': 4006, 'batches': 275, 'time': 10.321065425872803}\n",
      "{'total': 4031, 'batches': 276, 'time': 10.359257459640503}\n",
      "{'total': 4044, 'batches': 277, 'time': 10.397391080856323}\n",
      "{'total': 4049, 'batches': 278, 'time': 10.433672428131104}\n",
      "{'total': 4053, 'batches': 279, 'time': 10.47069501876831}\n",
      "{'total': 4056, 'batches': 280, 'time': 10.506794691085815}\n",
      "{'total': 4062, 'batches': 281, 'time': 10.54400372505188}\n",
      "{'total': 4078, 'batches': 282, 'time': 10.581243753433228}\n",
      "{'total': 4085, 'batches': 283, 'time': 10.618654251098633}\n",
      "{'total': 4088, 'batches': 284, 'time': 10.653578996658325}\n",
      "{'total': 4105, 'batches': 285, 'time': 10.69038438796997}\n",
      "{'total': 4123, 'batches': 286, 'time': 10.726439476013184}\n",
      "{'total': 4127, 'batches': 287, 'time': 10.760922193527222}\n",
      "{'total': 4137, 'batches': 288, 'time': 10.796860218048096}\n",
      "{'total': 4155, 'batches': 289, 'time': 10.833863735198975}\n",
      "{'total': 4169, 'batches': 290, 'time': 10.869922399520874}\n",
      "{'total': 4178, 'batches': 291, 'time': 10.903733968734741}\n",
      "{'total': 4189, 'batches': 292, 'time': 10.937456369400024}\n",
      "{'total': 4202, 'batches': 293, 'time': 10.971424579620361}\n",
      "{'total': 4221, 'batches': 294, 'time': 11.00601315498352}\n",
      "{'total': 4232, 'batches': 295, 'time': 11.04155158996582}\n",
      "{'total': 4266, 'batches': 296, 'time': 11.078522682189941}\n",
      "{'total': 4276, 'batches': 297, 'time': 11.114459037780762}\n",
      "{'total': 4276, 'batches': 298, 'time': 11.148620367050171}\n",
      "{'total': 4281, 'batches': 299, 'time': 11.183943748474121}\n",
      "{'total': 4289, 'batches': 300, 'time': 11.223152875900269}\n",
      "{'total': 4292, 'batches': 301, 'time': 11.258806943893433}\n",
      "{'total': 4342, 'batches': 302, 'time': 11.296767234802246}\n",
      "{'total': 4344, 'batches': 303, 'time': 11.333040475845337}\n",
      "{'total': 4362, 'batches': 304, 'time': 11.372807502746582}\n",
      "{'total': 4379, 'batches': 305, 'time': 11.415643215179443}\n",
      "{'total': 4394, 'batches': 306, 'time': 11.45637583732605}\n",
      "{'total': 4401, 'batches': 307, 'time': 11.49915361404419}\n",
      "{'total': 4419, 'batches': 308, 'time': 11.538679122924805}\n",
      "{'total': 4420, 'batches': 309, 'time': 11.576924800872803}\n",
      "{'total': 4439, 'batches': 310, 'time': 11.616462707519531}\n",
      "{'total': 4466, 'batches': 311, 'time': 11.656811237335205}\n",
      "{'total': 4475, 'batches': 312, 'time': 11.696592330932617}\n",
      "{'total': 4486, 'batches': 313, 'time': 11.735353231430054}\n",
      "{'total': 4500, 'batches': 314, 'time': 11.774617910385132}\n",
      "{'total': 4513, 'batches': 315, 'time': 11.813875913619995}\n",
      "{'total': 4525, 'batches': 316, 'time': 11.852798223495483}\n",
      "{'total': 4534, 'batches': 317, 'time': 11.89179015159607}\n",
      "{'total': 4534, 'batches': 318, 'time': 11.932564496994019}\n",
      "{'total': 4541, 'batches': 319, 'time': 11.971814632415771}\n",
      "{'total': 4569, 'batches': 320, 'time': 12.010237455368042}\n",
      "{'total': 4571, 'batches': 321, 'time': 12.046863317489624}\n",
      "{'total': 4579, 'batches': 322, 'time': 12.084763765335083}\n",
      "{'total': 4586, 'batches': 323, 'time': 12.122882843017578}\n",
      "{'total': 4591, 'batches': 324, 'time': 12.163264274597168}\n",
      "{'total': 4609, 'batches': 325, 'time': 12.20595669746399}\n",
      "{'total': 4626, 'batches': 326, 'time': 12.248904943466187}\n",
      "{'total': 4648, 'batches': 327, 'time': 12.291707754135132}\n",
      "{'total': 4648, 'batches': 328, 'time': 12.331486940383911}\n",
      "{'total': 4668, 'batches': 329, 'time': 12.376917362213135}\n",
      "{'total': 4704, 'batches': 330, 'time': 12.422920942306519}\n",
      "{'total': 4712, 'batches': 331, 'time': 12.469882726669312}\n",
      "{'total': 4729, 'batches': 332, 'time': 12.51641321182251}\n",
      "{'total': 4740, 'batches': 333, 'time': 12.560389757156372}\n",
      "{'total': 4761, 'batches': 334, 'time': 12.604487180709839}\n",
      "{'total': 4784, 'batches': 335, 'time': 12.6463143825531}\n",
      "{'total': 4790, 'batches': 336, 'time': 12.685370206832886}\n",
      "{'total': 4926, 'batches': 337, 'time': 12.727113246917725}\n",
      "{'total': 4976, 'batches': 338, 'time': 12.766765356063843}\n",
      "{'total': 4982, 'batches': 339, 'time': 12.80661654472351}\n",
      "{'total': 4995, 'batches': 340, 'time': 12.846444845199585}\n",
      "{'total': 4995, 'batches': 341, 'time': 12.883302688598633}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 4995, 'batches': 341, 'time': 12.883302688598633}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_sg_related_rel(sg_related_rel_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "ac84b109-c1b4-4154-8b72-0b1d608d6a64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 25, 'batches': 1, 'time': 0.040163278579711914}\n",
      "{'total': 54, 'batches': 2, 'time': 0.10362362861633301}\n",
      "{'total': 90, 'batches': 3, 'time': 0.13991665840148926}\n",
      "{'total': 112, 'batches': 4, 'time': 0.17568325996398926}\n",
      "{'total': 198, 'batches': 5, 'time': 0.21126723289489746}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 198, 'batches': 5, 'time': 0.21126723289489746}"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_dol_related_rel(dol_related_rel_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "6b3db7d1-5aaf-417b-9b0e-d4525701d98d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 45, 'batches': 1, 'time': 0.08003950119018555}\n",
      "{'total': 77, 'batches': 2, 'time': 0.11926436424255371}\n",
      "{'total': 101, 'batches': 3, 'time': 0.1554872989654541}\n",
      "{'total': 136, 'batches': 4, 'time': 0.19196224212646484}\n",
      "{'total': 158, 'batches': 5, 'time': 0.2290210723876953}\n",
      "{'total': 215, 'batches': 6, 'time': 0.2651851177215576}\n",
      "{'total': 229, 'batches': 7, 'time': 0.2801365852355957}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 229, 'batches': 7, 'time': 0.2801365852355957}"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_ppp_related_rel(ppp_related_rel_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8fd046f4-bb67-4456-b051-40768b53c44b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
